/* `welcomeLabel` UILabel text default value */
"Welcome" = "Tervetuloa";

/* `thankyouLabel` UILabel text default value */
"ThankyouMessage" = "Kiitos paikallisesta latauksesta";

/* `instructionTextView` UITextView text default value with \".notConfigurated\" state */
"WelcomeInstruction" = "Käynnistä aktivointiprosessi noudattamalla tervetulotoivotusviestissä olleita ohjeita.";

/* `instructionTextView` UITextView text default value with \".isConfigured\" state */
"ConfiguredInstruction" = "Pysy ajan tasalla päivittäisessä tehtävien hallinnassa ja tee helposti yhteistyötä projekteissa.";

"ScanInstruction" = "Aloita aktivointiprosessi skannaamalla suojattu QR-koodi.";

"DiscoveryServiceInstruction" = "Aloita aktivointiprosessi syöttämällä sähköpostiosoitteesi.";

/* checking the account(email address) user entered in discovery service */
"CheckingAccountKey" = "Tarkistetaan tiliä...";

/* `signInButton` UIButton's titleLabel?.text default value */
"SignIn" = "Aloita";

"Scan" = "Skannaa";

/* `demoLabel` UILabel text default value */
"Explore" = "Haluatko tutkia?";

/* `demoButton` UIButton's titleLabel?.text default value */
"TryDemo" = "Kokeile demoa";

/* The title for the passcode setup screens. */
"SetPasscodeKey" = "Määritä pääsykoodi";

/* The title for the enter passcode screen. */
"PasscodeKey" = "Pääsykoodi";

/* The title for the Choose Passcode screen. */
"ChoosePasscodeTitleKey" = "Valitse pääsykoodi";

/* The title for the Confirm Passcode screen. */
"ConfirmPasscodeTitleKey" = "Vahvista pääsykoodi";

/* The message on the confirm passcode screen for passcode setup. */
"EnterPasscodeAgainKey" = "Syötä pääsykoodi uudelleen.";

/* The message on the confirm passcode screen for passcode change. */
"ConfirmPasscodeKey" = "Vahvista pääsykoodisi.";

/* The message on the input passcode screen. */
"EnterYourPasscodeKey" = "Syötä pääsykoodisi.";

/* The title for the passcode change screens. */
"ChangePasscodeKey" = "Muuta pääsykoodia";

/* The message on the input passcode screen in change passcode. */
"EnterYourCurrentPasscodeKey" = "Syötä nykyinen pääsykoodisi";

/* The button title string used both in passcode and\n touch ID screens to indicate not to setup now. */
"NotNowKey" = "Ei nyt";

/* The button title string used on the second passcode setup\n to go back to the first screen. */
"BackKey" = "Paluu";

/* The button title string used on the first passcode setup\n to go to the next screen. */
"NextKey" = "Seuraava";

/* The button title string used on the passcode input screen (not in the change passcode sequence)\n When the passcode input screen is in the change passcode sequence, the button title should be changed \"Next\" */
"DoneKey" = "Valmis";

/* The main message format on the setup passscode screen.\n The %d will display the number of characters required from\n the passcode policy. */
"PasscodeChooseMinCharKey" = "Avaa sovelluksen lukitus valitsemalla pääsykoodi, jossa on vähintään %d merkkiä.";

/* The main message format on the setup passscode screen when the\n isDititsOnly property of the passcode policy is true.\n The %d will display the number of digits required from\n the passcode policy. */
"PasscodeChooseMinDigitKey" = "Avaa sovelluksen lukitus valitsemalla pääsykoodi, jossa on vähintään %d numeroa.";

/* The message for passcode to include the required character groups\n when passcode policy requires it. */
"PasscodeRequiredGroupKey" = "Sisällytä seuraavia:";

/* The group name for lower case letters. */
"LowerCaseKey" = "Pienet kirjaimet (a - z)";

/* The group name for upper case letters. */
"UpperCaseKey" = "Isot kirjaimet (A - Z)";

/* The group name for digits. */
"DigitsKey" = "Numerot (0 - 9)";

/* The group name for non-alphabetic characters. */
"Non-alphaKey" = "Symbolit (!@#...)";

/* The button title for resetting passcode. */
"ResetPasscodeKey" = "Palauta pääsykoodi";

/* Alert message when validate method of FUIPasscodeValidationDelegate\n returning false for the passcode user entered in setup passcode. */
"PasscodeValidationFailedKey" = "Pääsykoodin validointi epäonnistui.";

/* Alert message when the passcode user entered was rejected by\n the FUIPasscodeControllerDelegate's shouldTryPasscode function. */
"PasscodeRejectedKey" = "FUIPasscodeControllerDelegate hylkäsi pääsykoodin";

/* The alert button title used on passcode validation failed, or passcode rejected. */
"RetryKey" = "Yritä uudelleen";

/* The title for setup touch ID screen. */
"TouchIDKey" = "Kosketustunnus";

/* The title for setup touch ID screen. */
"FaceIDKey" = "Kasvontunnistus";

/* This is to be used combined with \"Touch ID\" or \"Face ID\", e.g., \"Touch ID is now available!\" */
"IsNowAvailableKey" = " on nyt käytettävissä.";

/* The first paragraph of the message on the Touch ID screen when no Touch ID is enrolled on device. */
"TouchIDMessage1Key" = "Kun aktivoit kosketustunnuksen, saat tietosi nopeammin käyttöösi.";

/* The second paragraph of the message on the Touch ID screen when no Touch ID is enrolled on device. */
"TouchIDMessage2Key" = "Voit ottaa tämän toiminnon käyttöön tai poistaa sen käytöstä milloin tahansa kohdassa Asetukset.";

/* The first paragraph of the message on the Touch ID screen when Touch ID is enrolled on device. */
"TouchIDEnableMessage1Key" = "Aktivoi kosketustunnus, jolloin käyttö on nopeampaa ja suojatumpaa.";

/* The second paragraph of the message on the Touch ID screen when Touch ID is enrolled on device. */
"TouchIDEnableMessage2Key" = "Jos kosketustunnuksen aktivointi on poistettu, sinulta pyydetään laitteen pääsykoodia.";

/* The first paragraph of the message on the Face ID screen when no Touch ID is enrolled on device. */
"FaceIDMessage1Key" = "Kun aktivoit kasvontunnistuksen, saat tietosi nopeammin käyttöösi.";

/* The second paragraph of the message on the Face ID screen when no Touch ID is enrolled on device. */
"FaceIDMessage2Key" = "Voit ottaa tämän toiminnon käyttöön tai poistaa sen käytöstä milloin tahansa kohdassa Asetukset.";

/* The first paragraph of the message on the Face ID screen when Touch ID is enrolled on device. */
"FaceIDEnableMessage1Key" = "Aktivoi kasvontunnistus, jolloin käyttö on nopeampaa ja suojatumpaa.";

/* The second paragraph of the message on the Face ID screen when Touch ID is enrolled on device. */
"FaceIDEnableMessage2Key" = "Jos kasvontunnistuksen aktivointi on poistettu, sinulta pyydetään laitteen pääsykoodia.";

/* The alert title to ask user add fingerprints to use Touch ID. */
"UseTouchIDTitleKey" = "Jotta voit käyttää kosketustunnusta lisää sormenjäljet laitteesi asetuksiin.";

/* The alert message to ask user add fingerprints to use Touch ID. */
"UseTouchIDMessageKey" = "Voit tehdä sen milloin tahansa kohdassa Asetukset - Kosketustunnus & pääsykoodi.";

/* The alert title to ask user add fingerprints to use Face ID. */
"UseFaceIDTitleKey" = "Jos haluat käyttää kasvontunnistusta, rekisteröi kasvontunnistus laitteen asetuksiin.";

/* The alert message to ask user add fingerprints to use Face ID. */
"UseFaceIDMessageKey" = "Voit tehdä sen milloin tahansa kohdassa Asetukset - Kasvontunnistus & pääsykoodi.";

/* The message for the link on the Touch ID screen. */
"LearnMoreKey" = "Lisätietoja kosketustunnuksesta";

/* The message for the link on the Face ID screen. */
"LearnMoreFaceIDKey" = "Lisätietoja kasvontunnistuksesta";

/* The button title to enable Touch ID authentication. */
"EnableKey" = "Aktivoi";

/* The message displayed when authticate with Touch ID. */
"AuthWithTouchIDKey" = "Todenna kosketustunnuksen avulla";

/* The message displayed when authticate with Face ID. */
"AuthWithFaceIDKey" = "Todenna kasvontunnistuksen avulla";

/* The title on the navigation bar. */
"TouchIDErrorNavigationTitleKey" = "Virhe";

/* The error title. */
"AuthenticationErrorKey" = "Todennusvirhe";

/* The error message for Touch ID devices. */
"AuthenticationTouchIDMessageKey" = "Todenna kosketustunnuksen avulla sovelluksen käyttämiseksi.";

/* The error message for Face ID devices. */
"AuthenticationFaceIDMessageKey" = "Todenna kasvontunnistuksen avulla sovelluksen käyttämiseksi.";

/* The authenticate button text. */
"AuthenticateKey" = "Todenna";

/* The message when the passcode entered in confirm passcode screen\n does not match with the one entered in the setup passcode screen. */
"PasscodeNotMatchKey" = "Pääsykoodit eivät täsmänneet. Yritä uudelleen.";

/* The message format to be displayed when user entered wrong passcode\n and the remaining number of retries is greater than 1. */
"AttemptsLeftKey" = "Sinulla on %d yritystä jäljellä.";

/* The message format to be displayed when user entered wrong passcode\n and there is only one remaining retry. */
"OneAttemptLeftKey" = "Sinulla on 1 yritys jäljellä.";

/* The first paragraph of the alert message when the number user entered\n wrong passcode reached maximum allowed. */
"MaxAttemptsReachedKey" = "Ei enää yrityksiä jäljellä.";

/* The second paragraph of the alert message when the number user entered\n wrong passcode reached maximum allowed. */
"EnterCredentialsKey" = "Palauta pääsykoodi kirjautumalla sisään.";

/* The text of the dismiss button on the alert. */
"OKKey" = "OK";

/* The message on the passcode screen when user entered wrong passcode\n and there is no limit on the number of retries. */
"RetryPasscodeKey" = "Virheellinen pääsykoodi. Yritä uudelleen.";

/* The scan page title string. */
"ScanKey" = "Skannaa";

/* The title of the pop-up message when user selected a QR code photo\n which did not have a valid QR code. */
"ScanUnsuccessfulKey" = "Skannaus ei onnistunut";

/* The second line of the pop-up message when user selected a QR code photo\n which did not have a valid QR code. */
"SelectAnotherImageKey" = "Valitse QR-koodikuva.";

/* The title of the pop-up message when user successfully got a QR code for\n onboarding activation but this QR code was not recognized by system. */
"InvalidQRCodeKey" = "Virheellinen QR-koodi";

/* The second line of the pop-up message when user successfully got a QR code for\n onboarding activation but this QR code was not recognized by system. */
"QRCodeNotRecognizedKey" = "QR-koodia ei tunnistettu.";

/* The title of the alert to request photo access. */
"AllowPhotoAccessKey" = "Salli valokuvien käyttö";

/* The message of the alert to request photo access. */
"GiveAccessToPhotoSettingsKey" = "Jotta voit valita QR-koodikuvan, salli valokuvien käyttö laitteesi yksityisyyttä koskevissa asetuksissa.";

/* The title of the alert to request camera access. */
"AllowCameraAccessKey" = "Salli kameran käyttö";

/* The message of the alert to request camera access. */
"GiveAccessToCameraSettingsKey" = "Jotta voit skannata kameran avulla, salli kameran käyttö laitteesi yksityisyyttä koskevissa asetuksissa.";

/* *\n The alert action title to go to Settings app. */
"SettingsKey" = "Asetukset";

/* The title string for the QR code scan confirmation screen. */
"ConfirmationKey" = "Vahvistus";

/* The success message for the QR code scan confirmation screen. */
"ScanSucceededKey" = "Skannaus onnistui. Yhteys muodostetaan:";

/* The title string for the \"Continue\" button */
"ContinueKey" = "Jatka";

/* The title string for the back bar button on activation screen */
"BackBarButtonForActivationScreenKey" = "Käynnistä";

/* FUIActivation Screen - headlineLabel */
"FUIActivationScreen_headlineLabel" = "Aktivointi";

/* FUIActivation Screen - detailLabel */
"FUIActivationScreen_detailLabel" = "Jos sait tervetulotoivotusviestin, noudata sähköpostin aktivointilinkkiä. Muussa tapauksessa syötä sähköpostiosoitteesi tai skannaa QR-koodi, jotta voita aloittaa käyttöönoton.";

/* FUIActivation Screen - primaryActionButton Title */
"FUIActivationScreen_primaryActionButtonTitle" = "Seuraava";

/* FUIActivation Screen - subheadlineLabel */
"FUIActivationScreen_subheadlineLabel" = "Tai";

/* FUIActivation Screen - primaryActionButton Title */
"FUIActivationScreen_secondaryActionButtonTitle" = "Skannaa";

/* FUIEULAView Screen - agree button */
"AgreeKey" = "Hyväksyn";

/* FUIEULAView Screen - disagree button */
"DisagreeKey" = "En hyväksy";

/* The authentication title. */
"AuthenticationKey" = "Todentaminen";

/* The basic authentication message. */
"basicAuthenticationMessageKey" = "Todenna syöttämällä käyttäjänimesi ja salasanasi.";

/* Username input field placeholder string */
"usernameKey" = "käyttäjänimi";

/* Password input field placeholder string */
"passwordKey" = "salasana";

/* Sign In button string. */
"SignInKey" = "Kirjaudu";

/* Error message when failed to sign in. */
"SignInErrorKey" = "Virheelliset tunnistetiedot. Yritä uudelleen.";

/* The dynamic authentication message. */
"DynamicAuthenticationMessageKey" = "Aloita aktivointiprosessi syöttämällä alla olevat tiedot.";

/* The message displayed on the banner when verifying information user entered. */
"VerifyingMessageKey" = "Tarkistetaan tietoja...";

/* Cancel button string. */
"CancelKey" = "Peruuta";

/* Allow button string. */
"AllowKey" = "Salli";

/* Deny button string. */
"DenyKey" = "Kiellä";

/* No button string. */
"NoKey" = "Ei";

/* Quit button string. */
"QuitKey" = "Lopeta";

/* GiveConsent button string. */
"GiveConsentKey" = "Anna suostumus";

/* Navbar title string. */
"StepKey" = "Askel";

/* Navbar title string. */
"OfKey" = "/";

/* CancelConfirmation message string. */
"CancelConfirmationKey" = "Haluatko varmasti lopettaa käyttöönottoprosessin?";

/* MandatoryMessage button string. */
"MandatoryMessageKey" = "Et voi jatkaa käyttöönottoa ilman suostumusta.";

/* Switch User button string. */
"SwitchOrAddUserKey" = "Vaihda tai lisää käyttäjä";

/* Title for Log In button */
"LogInKey" = "Kirjaudu";

/* Placeholder text in search bar for searching users in multi-user login controller */
"SearchUsersKey" = "Hae käyttäjiä tässä laitteessa";

/* The button title for forgot passcode. */
"ForgotPasscodeKey" = "Unohditko pääsykoodin?";

